tap "homebrew/bundle"
tap "oven-sh/bun"
brew "gcc"
brew "bat"
brew "clipboard"
brew "cmake"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "gh"
brew "graphviz"
brew "imagemagick"
brew "lazygit"
brew "luarocks"
brew "make"
brew "neofetch"
brew "neovim"
brew "node"
brew "powerlevel10k"
brew "pyenv"
brew "ripgrep"
brew "ruff"
brew "rustup"
brew "utf8proc", args: ["HEAD"]
brew "uv"
brew "xclip"
brew "xsel"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-fast-syntax-highlighting"
brew "oven-sh/bun/bun"
