tap "felixkratz/formulae"
tap "homebrew/command-not-found"
tap "jandedobbeleer/oh-my-posh"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "krtirtho/apps"
tap "majd/repo"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "surrealdb/tap"
tap "yakitrak/yakitrak"
brew "openssl@3"
brew "autoconf"
brew "automake"
brew "bat"
brew "bat-extras"
brew "btop"
brew "carapace"
brew "clipboard"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "eza"
brew "fastfetch"
brew "fd"
brew "libtool"
brew "frotz"
brew "fzf"
brew "gcc"
brew "gh"
brew "libarchive"
brew "glow"
brew "pkgconf"
brew "graphviz"
brew "gsettings-desktop-schemas"
brew "helix"
brew "htop"
brew "imagemagick"
brew "jp2a"
brew "jpeg"
brew "jq"
brew "just"
brew "lazygit"
brew "libev"
brew "libpcap"
brew "libusbmuxd"
brew "libvirt", restart_service: :changed
brew "lsix"
brew "luarocks"
brew "make"
brew "mise"
brew "neofetch"
brew "neovim"
brew "node"
brew "ouch"
brew "pandoc"
brew "poppler"
brew "powerlevel10k"
brew "prettyping"
brew "pyenv"
brew "pygobject3"
brew "python-launcher"
brew "pytorch"
brew "ripgrep"
brew "rlwrap"
brew "ruby"
brew "ruff"
brew "rust"
brew "rust-analyzer"
brew "rustup"
brew "speedtest-cli"
brew "spicetify-cli"
brew "starship"
brew "tealdeer"
brew "uv"
brew "viu"
brew "wget"
brew "xclip"
brew "xh"
brew "xsel"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-fast-syntax-highlighting"
brew "oven-sh/bun/bun"
vscode "1nvitr0.random-sample"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.rtf"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "htmlhint.vscode-htmlhint"
vscode "ibm.output-colorizer"
vscode "idleberg.icon-fonts"
vscode "jscearcy.rust-doc-viewer"
vscode "kamikillerto.vscode-colorize"
vscode "kevinrose.vsc-python-indent"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "meronz.manpages"
vscode "minecraftcommands.syntax-mcfunction"
vscode "misodee.vscode-nbt"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "naumovs.color-highlight"
vscode "nefrob.vscode-just-syntax"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "oderwat.indent-rainbow"
vscode "oven.bun-vscode"
vscode "pranaygp.vscode-css-peek"
vscode "prateekmahendrakar.prettyxml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sketchbuch.vsc-quokka-statusbar"
vscode "sourcegraph.sourcegraph"
vscode "spgoding.datapack-language-server"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "sweetpad.sweetpad"
vscode "swellaby.rust-pack"
vscode "swellaby.vscode-rust-test-adapter"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomoki1207.pdf"
vscode "tonybaloney.vscode-pets"
vscode "trunk.io"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "vknabel.vscode-apple-swift-format"
vscode "vscode-icons-team.vscode-icons"
vscode "vscode-snippet.snippet"
vscode "waderyan.gitblame"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "xadillax.viml"
vscode "yandeu.five-server"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
