tap "felixkratz/formulae"
tap "homebrew/command-not-found"
tap "jandedobbeleer/oh-my-posh"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "krtirtho/apps"
tap "majd/repo"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "surrealdb/tap"
tap "yakitrak/yakitrak"
brew "openssl@3"
brew "autoconf"
brew "automake"
brew "bat"
brew "bat-extras"
brew "carapace"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "duf"
brew "exercism"
brew "eza"
brew "fastfetch"
brew "fd"
brew "libtool"
brew "frotz"
brew "fzf"
brew "gcc"
brew "gh"
brew "libarchive"
brew "glow"
brew "gnu-typist"
brew "pkgconf"
brew "graphviz"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "helix"
brew "htop"
brew "imagemagick"
brew "jp2a"
brew "jpeg"
brew "jq"
brew "just"
brew "lazygit"
brew "libev"
brew "libpcap"
brew "libusbmuxd"
brew "libvirt", restart_service: :changed
brew "lsix"
brew "luarocks"
brew "make"
brew "mise"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "node"
brew "ouch"
brew "pandoc"
brew "pipes-sh"
brew "pipx"
brew "poppler"
brew "powerlevel10k"
brew "prettyping"
brew "pygobject3"
brew "python-launcher"
brew "pytorch"
brew "ripgrep"
brew "rlwrap"
brew "ruby"
brew "ruff"
brew "rust"
brew "rust-analyzer"
brew "s-lang"
brew "speedtest-cli"
brew "tealdeer"
brew "uv"
brew "viu"
brew "wget"
brew "xclip"
brew "xh"
brew "xsel"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-fast-syntax-highlighting"
brew "oven-sh/bun/bun"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "eamodio.gitlens"
vscode "ewen-lbh.vscode-hyprls"
vscode "fill-labs.dependi"
vscode "fireblast.hyprlang-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.bettercomment"
vscode "jinliming2.vscode-go-template"
vscode "ms-vscode-remote.remote-containers"
vscode "polymeilex.rust-targets"
vscode "premparihar.gotestexplorer"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "zhangyue.rust-mod-generator"
